ro_con_views/ninecats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
    kitten = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    kitten = Cat.find_by(id: params[:id])