routesW6D4/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    user = User.find_by(id: params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    art = Artwork.find_by(id: params[:id])

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "BASQUIAT"], ["image_url", "cool.com"], ["artist_id", 6]]
---
  def create
    new_art = Artwork.new(artwork_params)
    if new_art.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1 WHERE "artworks"."id" = $2  [["image_url", "reallycool.com"], ["id", 8]]
---
  def update
    found_art = Artwork.find_by(id: params[:id])
    if found_art.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]
---
  def destroy
    killed_art = Artwork.find_by(id: params[:id])
    if killed_art.destroy