routesW6D4/app/controllers/artwork_shares_controller.rb

  def create
    share = ArtworkShare.new(artwork_share_params)
    if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 11], ["viewer_id", 1], ["created_at", "2019-09-26 22:32:16.905253"], ["updated_at", "2019-09-26 22:32:16.905253"]]

  def destroy
    art_share = ArtworkShare.find_by(id: params[:id])
    if art_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 18]]