routesW6D4/app/controllers/users_controller.rb

  def index
    all_of_em = User.all
---
SELECT "users".* FROM "users"

  def show
    specific = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    guy = User.new(user_params)
    if guy.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-09-26 18:54:53.363509"], ["updated_at", "2019-09-26 18:54:53.363509"], ["username", "Kelly"]]

  def update
    guy = User.find_by(id: params[:id])
    if guy.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Braeden Austgen"], ["updated_at", "2019-09-26 20:25:44.280282"], ["id", 1]]

  def destroy
    guy = User.find_by(id: params[:id])
    if guy
      guy.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]